{
  "items": [
    {
      "id": "c9c5b434411",
      "title": "Having a Great Website is only Half the Story",
      "pubDate": "2017-07-20 00:27:31",
      "link": "https://medium.jasonmdesign.com/having-a-great-website-is-only-half-the-story-c9c5b434411?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/c9c5b434411",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "duration": 6,
      "coverImage": "https://cdn-images-1.medium.com/max/2000/1*fdsz6Cmog-pFxnJeMH82RQ.png",
      "thumbnail": "https://cdn-images-1.medium.com/max/2000/1*fdsz6Cmog-pFxnJeMH82RQ.png",
      "description": "We all know that a website and an online presence are essential parts to owning a business, a brand, or in general living in this modern age. Heck I have multiple websites between my personal website, my business website, and a few side projects, and I bet you probably do too.",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*fdsz6Cmog-pFxnJeMH82RQ.png\"></figure><p>We all know that a website and an online presence are essential parts to owning a business, a brand, or in general living in this modern age. Heck I have multiple websites between my personal website, my business website, and a few side projects, and I bet you probably do too.</p>\n<p>That’s not why you’re here today though. You’re here because you want to learn what more you need to do to make your websites great! Well I’m here to tell you that you need multiple things for a great website and that these are all going to vary depending on who you ask.</p>\n<p>Ask a SEO expert whats most important for a website and he’ll say SEO. Ask a designer whats most important and he will say something that will roughly translate to “good design” whether it be UX, UI, or some other form or design. Ask a developer and he will tell you that neither of these things matter if your websites code is wonky, if it doesn’t function right.</p>\n<p>So what am I here to tell you that these three disciplines wont? Well that’s simple. <strong>They’re all right.</strong> That’s right you need all of these things and many others to get the most out of your website.</p>\n<p>Often you’ll see people spend thousands of dollars on the design and development of their website but nothing on the promotion or marketing of it.</p>\n<p>You will have to excuse my ignorance of fine art here. But do you think that the Mona Lisa, painted by Leonardo da Vinci. One of, if not the worlds most famous painting would be worth as much if after da Vinci’s death in 1519 whoever inherited this painting shoved it in a closet along with the rest of Leonardo’s paintings never to be seen by the world again? I doubt it, sure I imagine at some point someone would have found them dragged them out and put them on display but I doubt it would be as famous or worth as much as it is today.</p>\n<p>We aren’t here to talk about paintings though. We want to talk about website. What I am really trying to get at here is that you need a well rounded approach to your website. Spending thousands of 💲 💲 💲 on a designer and developer will do you no good if no one sees your website. Likewise a brilliantly marketed website with thousands of visitors every day hitting it will never be as effective if it’s design, and user experience is horrible. It should be noted here that if your business sucks none of these things will help, a website and marketing can’t make up for a poor product or plan.</p>\n<p>So what am I saying to do? Simple a two step approach to your website.</p>\n<h4>Step 1</h4>\n<p>Figure out who your market is and design your website to capture their attention. You should probably have a solid idea of who your customers are and what they are looking for. Give your designer as much of this information as you can and if they are any good, pretty soon you will have a website that both looks good and captures your audience / clients attention. Don’t skimp on your developer either, sure it should be nice and simple but a good developer will ensure that your website works for years to come and doesn’t just break with the next update that comes along. They will also ensure that everything is modular and well documented, making sure that in the future changes and even changing your developer will be a painless process.</p>\n<h4>Step 2</h4>\n<p>Great you have a awesome looking website, it functions well and is designed to capture your markets attention. Now the most important thing you can do is to market it. There are so many ways of marketing a website that diving into each of them in this article would be useless. I am sure that a quick Google search will provide you with hundreds of options. Don’t get overwhelmed here though look through all your options and chose three maybe four of them to master, and then get to work. A web agency might help you with these but there is no way if you have simply paid an up front cost of $X for your website that they will keep doing this indefinitely. Sure they might set up some basic SEO and do a little marketing to begin with but without a monthly fee you can be sure they aren’t doing anything. So you either need to do this yourself or get someone on board who will.</p>\n<h4>Finishing up</h4>\n<p>So with those two steps done you should be set. Knowing both sides of the story will help you and your business grow like never before. You’ll have a website that doesn’t look like rubbish and actually converts those that land on it, and you will actually have real humans looking at it to be converted. With these things done you’re set to bust into the big leagues.</p>\n<p>If you liked this article please click the 💚 below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=c9c5b434411\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/having-a-great-website-is-only-half-the-story-c9c5b434411\">Having a Great Website is only Half the Story</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "marketing",
        "business-development",
        "web-development",
        "business-growth",
        "online-marketing"
      ]
    },
    {
      "id": "98d63676fcc7",
      "title": "Modern Marketing Website Template",
      "pubDate": "2017-11-17 02:26:09",
      "link": "https://medium.jasonmdesign.com/modern-marketing-website-template-98d63676fcc7?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/98d63676fcc7",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "coverImage": "https://cdn-images-1.medium.com/max/1024/1*IrnfyiwVVxo6IBDCM-h0-A.jpeg",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*IrnfyiwVVxo6IBDCM-h0-A.jpeg",
      "duration": 4,
      "description": "Working as a web design, day to day tasks can vary wildly. There is, however, one thing that I think we can all agree should be part of web designers daily routine. That is designing website",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*IrnfyiwVVxo6IBDCM-h0-A.jpeg\"></figure><p>Working as a web design, day to day tasks can vary wildly. There is, however, one thing that I think we can all agree should be part of web designers daily routine. That is designing website.</p>\n<p>Sometimes this is easier said than done however with client work, emails and small tasks sometimes actually getting your hands dirty and designing or coding something doesn’t happen. I think this is wrong however so I put together this little website template.</p>\n<h4><a href=\"https://jasonmdesign.com/demo/lanx/\">Marketing Website Template</a></h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*p74jGs7kPU1GhcaDRFHcQg.jpeg\"></figure><p>I can’t take all the credit, however, I grabbed a PSD template from <a href=\"http://www.graphberry.com/item/montreal-creative-portfolio-theme\">Graphberry</a> and went at it. Coding up this free template. I have plans for expanding on this to other pages in the future but for now what you see is what you get.</p>\n<p>For and developers wanting to use this. The technical details are that it was built using a gulp workflow, intertwined with Jekyll site generator for future expandability. The HTML is handled with PUG and the CSS with sass as the pre-processors. A quick bundle install and npm i in the home directory will get you up and running with the only thing left to run the default gulp task and you’ll be looking at everything hosted on your own local server spun up with browserSync.</p>\n<p>I hope that you find this useful, and most of all enjoy using this as much as I enjoyed making it.</p>\n<p>The <a href=\"https://github.com/jasonm4130/Lanx-V2\">GitHub</a> repo is here the readme needs a little work, and I promise I’ll get to that!</p>\n<p>If you liked this article please click the 💚 below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=98d63676fcc7\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/modern-marketing-website-template-98d63676fcc7\">Modern Marketing Website Template</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "front-end-development",
        "web-design",
        "web-development",
        "website",
        "html-templates"
      ]
    },
    {
      "id": "411bba48bb30",
      "title": "How to Speed Up Your Website in One Easy Step",
      "pubDate": "2017-07-19 00:38:14",
      "link": "https://medium.jasonmdesign.com/how-to-speed-up-your-website-in-one-easy-step-411bba48bb30?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/411bba48bb30",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "duration": 5,
      "coverImage": "https://cdn-images-1.medium.com/max/1024/1*VJXyf-ObZsUA2ZyA1st-Sg.png",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*VJXyf-ObZsUA2ZyA1st-Sg.png",
      "description": "So you want a faster website? Well I am about to blow your mind with how quick and easy it is to make your website lightning fast! Oh and did I mention we are going to do this in just one step?",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*VJXyf-ObZsUA2ZyA1st-Sg.png\"></figure><p>So you want a faster website? Well I am about to blow your mind with how quick and easy it is to make your website lightning fast! Oh and did I mention we are going to do this in just one step?</p>\n<p>Ok well maybe one step is a little bit of an exaggeration, but trust me it’s going to be quick, easy, and painless.</p>\n<h4>First thing’s first</h4>\n<p>Head on over to <a href=\"https://www.cloudflare.com/\">cloudflare.com</a> and sign up for an account. Pretty easy so far right?</p>\n<h4>Next up</h4>\n<p>You’ll be asked to enter a website address. This should be the address of the website you want to speed up.</p>\n<p>Cloudflare will scan your name records and work its magic! and once that’s finished you are on your way.</p>\n<h4>Double Check</h4>\n<p>Alright this is the tricky bit and you better pay attention now. You will be shown a bunch of DNS records like the picture below. You need to make sure that the scan Cloudflare just did captured all of the records you have attached with your current DNS provider. I’d recommend logging into your DNS provider and double checking them against each other. If you skip this and a record is missing, you can be certain that some part of your website, emails, or business is going to be broken.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/999/1*z1KSlNbMChpvKZ_ZaRtgbw.png\"></figure><h4>Moving to Cloudflare</h4>\n<p>So you have made sure all your DNS records are there right? Great! You’re all set to move on and get started using Cloudflare. Follow their instructions for setting up their name servers with your name register. They have great guides and do a much better job than I could. Once this is done you are set. The name server change will slowly spread to all the DNS servers, like that rumor you started in high-school. Once it has finished spreading you are set. You’re using Cloudflare.</p>\n<h4>A few things left</h4>\n<p>Alright so you’re set up with Cloudflare but we’re not done yet. There’s 3 more things I want you to do to ensure that your site is super fast!</p>\n<ol>\n<li>Minify</li>\n<li>Cache</li>\n<li>Page Rules</li>\n</ol>\n<p>When we have these three things done you know your site will be loading fast!</p>\n<h4>1. Minify</h4>\n<p>First things first I want you to head on over to the speed tab in your dashboard and make sure that you are auto minifying all your JS, CSS, and HTML. All this will do is strip out any unnecessary characters like comments from your data and squish it all onto less lines. This just helps these resources use less space, and less space means faster transfers!</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/964/1*9y_qXju73RBIqBfedSODfg.png\"></figure><p>One big thing to watch out for is with the minification and especially the JS minification, sometimes if your code isn’t quite right the minification process will break it and you might need to dig around a little for that ; you missed.</p>\n<h4>2. Caching</h4>\n<p>Pay attention as this one is important. First before we play with any of these settings we are going to need to understand them a little first. The two settings on the cache tab that I want you to pay attention to are Browser Cache Expiration, and Caching Level.</p>\n<p>Browser Cache Expiration, this is how long a browser will keep your website files locally. Now this is where you are going to have to decide for yourself how long is right for you and your website. For me I have mine set for 1 day as I don’t have a lot of return visitors, you either get in touch with me about your project or you find someone else, you don’t come back that often. I could set it longer but I am always playing with little tweaks here and there on my site and if I change anything in the CSS and JS that is cached by a local machine, that my site requires to work properly. You’re going to see a messed up site or just nothing at all. Not a great look for a front end dev.</p>\n<p>If your site was a large news publication however you might want to set it longer as you have visitors coming back pretty often, hopefully daily. You also probably aren’t changing the look of your site as often. So you can let people keep the cached content longer, maybe a month or so.</p>\n<p>The next setting on this page we should look at is the caching level. This requires us to know a little about query strings. A query string would look something like http://jasonmatthew.me/form?name=jason This doesn’t actually do anything on my site but hopefully you get the idea. It tells the web server to do something with some information in the url. A common example of this is in the WordPress search functionality.</p>\n<p>Now we know what a query string is we have to decide what to do with them. Cloudflare gives us three options. If you don’t know 100% that your website doesn’t use query strings I would suggest that you leave this on standard.</p>\n<p>Cloudflare again has some really good documentation on this to <a href=\"https://support.cloudflare.com/hc/en-us/articles/200168256-What-are-Cloudflare-s-caching-levels-\">take a look at</a> if you’re not sure or want to learn more.</p>\n<h4>3. Page Rules</h4>\n<p>This is where things get tricky. Below you can see my three page rules. We only want to pay attention to the first one however. In this we set the url to our site jasonmdesign.com/* where the * denotes anything. so everything will be cached. This means that all of our pages will be cached on the Cloudflare edge servers and on the users browser. Here you can also change these settings specifying the TTL or time to live for these cached resources.</p>\n<p>Again I will use the example of a news site here, because you are adding articles every few hours, or at least every day you probably don’t want to cache your home page or your blog page. To do this you could setup a page rule that looked something like jasonmdesign.com/blog/* this would only cache the articles in blog/ but not the blog itself assuming the blog is your home page.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/973/1*zyAjDmTA2Wx2_Lqn_7mXFw.png\"></figure><h4>Finishing up</h4>\n<p>With these setting changed you are well on your way to speeding up your site. Go and double check that all of these changes haven’t effected anything. A pro tip for this is to use the incognito option in your browser as this will eliminate and caching that has happened and show you what a brand new visitor would see and experience loading your site for the first time.</p>\n<p>I hope you have found this helpful, feel free to comment below if you have any questions, need a hand with setting this up, or just want to say hi.</p>\n<p>If you liked this article please click the 💚 below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=411bba48bb30\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/how-to-speed-up-your-website-in-one-easy-step-411bba48bb30\">How to Speed Up Your Website in One Easy Step</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "cdn",
        "website",
        "cache",
        "web-development",
        "servers"
      ]
    },
    {
      "id": "1236028a2d26",
      "title": "How to Display Medium Articles on WordPress and Why",
      "pubDate": "2017-06-15 07:10:45",
      "link": "https://medium.jasonmdesign.com/how-to-display-medium-articles-on-wordpress-and-why-1236028a2d26?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/1236028a2d26",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "duration": 8,
      "coverImage": "https://cdn-images-1.medium.com/max/800/1*ZqSZkCq42m99Axe2VZbizQ.jpeg",
      "thumbnail": "https://cdn-images-1.medium.com/max/800/1*ZqSZkCq42m99Axe2VZbizQ.jpeg",
      "description": "One week ago I wrote my most successful Medium Article yet.",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ZqSZkCq42m99Axe2VZbizQ.jpeg\"></figure><p>One week ago I wrote my most successful Medium Article yet. <a href=\"https://medium.jasonmdesign.com/display-medium-articles-on-your-site-d772b3b05779\">Display Medium articles on your website</a>. I’m not sure why it was my most popular but I suspect it was because I answered a question that I had. I wasn’t writing the article for anyone else but me. Now with the popularity of that post (only a few hundred views but we all start somewhere right?) I got emails and request, from readers who aren’t coders. People for who maybe my last tutorial wasn’t exactly clear.</p>\n<p>I assumed that these people would be running WordPress as the most widely used content management system on the internet, this is a pretty safe assumption. With one reader who emailed me I tried to walk him through how to integrate my code with his WordPress theme, which worked out, but this isn’t ideal as for each WordPress theme this process will be different.</p>\n<p>So to help with anyone else looking for a way to display Medium posts on their WordPress site I have written a plugin that simply adds the HTML, CSS and JS from my previous article to your WordPress install and provides a simple back-end menu allowing for you to configure the display as you want.</p>\n<h4>Adding Medium Articles</h4>\n<p>To use the plugin I made, simply go to my Repo on GitHub <a href=\"https://github.com/jasonm4130/Medium-Parser-WordPress-Plugin\">https://github.com/jasonm4130/Medium-Parser-WordPress-Plugin</a> download the zip file the you are set to upload this into your plugin files.</p>\n<p>There is a settings page that you will need to put in a few details but other than that everything should work as expected.</p>\n<p>It should however be noted that this plugin is still in early stages and I am completely open to suggestions about adding features or styling allowing for more customization.</p>\n<p>Hopefully in the next few days this plugin will be available on WordPress.org but until then. Hope you find this helpful.</p>\n<p>If you liked this article please click the ❤ below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=1236028a2d26\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/how-to-display-medium-articles-on-wordpress-and-why-1236028a2d26\">How to Display Medium Articles on WordPress and Why</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "wordpress",
        "web-development",
        "medium",
        "plugins"
      ]
    },
    {
      "id": "d772b3b05779",
      "title": "Display Medium articles on your site.",
      "pubDate": "2017-06-04 11:02:01",
      "link": "https://medium.jasonmdesign.com/display-medium-articles-on-your-site-d772b3b05779?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/d772b3b05779",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "duration": 9,
      "coverImage": "https://cdn-images-1.medium.com/max/1024/1*_0qTMYSGXvz8tELYKl43-g.jpeg",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*_0qTMYSGXvz8tELYKl43-g.jpeg",
      "description": "For a while now I have been trying understand how I can best use medium and my own personal site together in harmony. Today I think I found my answer!",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*_0qTMYSGXvz8tELYKl43-g.jpeg\"></figure><p>For a while now I have been trying understand how I can best use medium and my own personal site together in harmony. Today I think I found my answer!</p>\n<p>So we all know that medium is a great place to host your blog for a number of reasons. So much so that I’m not going to go into them today more than simply saying you need to be posting here.</p>\n<p>But.. There is something special about having your articles on your own website that makes you the owner. That makes you feel in control. Now there is of course the import functionality of medium where a post will get brought into the system and then linked back to your original site or wherever it came from. This is good but not ideal, if you have to manually do it for every article you write.</p>\n<p>A better option provided weather you are using WordPress or another CMS platform or even a static site generator like Jekyll is to use some form of plugin to automatically preform the import functionality whenever you publish a new post. This is a better alternative, but still not quite there.</p>\n<p>When I think about the above alternative their biggest shortcomings is that you are still building your following in two different places. Sure these places are thinly linked but it’s still not idea. Enter my solution…</p>\n<h3>Embed your Medium posts on your website</h3>\n<p>For the amount of medium users out there I am really surprised at the lack of information available on this. Don’t fear however, it’s quite simple to do once you know what needs to be done.</p>\n<h4>Step 1: Get your JSON</h4>\n<p>The first thing we are going to need to embed our posts is said posts in a computer readable format.</p>\n<p>Your first instinct might be to tag a “latest?format=json” query onto the end of your user or publication, but this isn’t going to help us much. While it will get the JSON that we need. It won’t help because Medium will throw a CORS error. Which basically means that we cant use anything from the Medium domain on our own site. Bummer…</p>\n<p>What now? There is a handy site called <a href=\"https://rss2json.com/\">rsstojson.com</a> which will convert our RSS feed which Medium can provide into the JSON we need. This site is handy for learning what needs to be done and for the docs contained there but since I will be providing the code we don’t actually need to do anything there yet.</p>\n<h4>Step 2: Using the Json</h4>\n<p>To use the API that rsstojson provide we need to first include jQuery this is easy enough and you’ve probably already done it. If not however simply include it by having the code:</p>\n<pre>&lt;script src=\"<a href=\"https://code.jquery.com/jquery-2.2.4.min.js\">https://code.jquery.com/jquery-2.2.4.min.js</a>\"&gt;&lt;/script&gt;</pre>\n<p>At the end of your body element. After we have included jQuery we are all set to start using the provided API. The code below shows a simple example where the API will convert the feed from techcrunch.com to JSON and then output this into the div with an id of content.</p>\n<pre>&lt;script type=\"text/javascript\"&gt;<br>    $(function() {<br>        var $content = $('#content');<br>        var data = {<br>            rss_url: 'https://techcrunch.com/feed/'<br>        };</pre>\n<pre>$.get('https://api.rss2json.com/v1/api.json', data, function(response) {<br>            if (response.status == 'ok') {<br>                var output = '&lt;h1&gt;' + response.feed.title + '&lt;/h1&gt;';</pre>\n<pre>$.each(response.items, function(k, item) {<br>                    output += '&lt;h2&gt;&lt;a href=\"' + item.link + '\" &gt;' + item.title + '&lt;/h2&gt;&lt;/a&gt;';<br>                    output += '&lt;p&gt;' + item.description + '&lt;/p&gt;';<br>                });</pre>\n<pre>$content.html(output);</pre>\n<pre>}</pre>\n<pre>});</pre>\n<pre>});<br>&lt;/script&gt;</pre>\n<p>Since this will require some modifications let’s dive into the actual code. The snippet below will define our variables first the element on the page that we want the output to be displayed in #content, then the actual feed that we want parsed. Being techcrunch.com. You will want to change this url variable to that of your medium feed. For me this was <a href=\"https://medium.jasonmdesign.com/feed\">https://medium.jasonmdesign.com/feed</a> as I was using my publication. But if you wanted it for just your personal user it would be <a href=\"https://medium.com/feed/@Medium\">medium.com/feed/@Medium</a> where @Medium is your username. More info on this can be found <a href=\"https://help.medium.com/hc/en-us/articles/214874118-RSS-feeds\">here</a> in the medium documentation.</p>\n<pre>var $content = $('#content');<br>var data = {<br>  rss_url: 'https://techcrunch.com/feed/'<br>};</pre>\n<p>With these changes made we are ready to start bringing in our content.</p>\n<pre>$.get('https://api.rss2json.com/v1/api.json', data, function(response) {<br>            if (response.status == 'ok') {<br>                var output = '&lt;h1&gt;' + response.feed.title + '&lt;/h1&gt;';</pre>\n<pre>$.each(response.items, function(k, item) {<br>                    output += '&lt;h2&gt;&lt;a href=\"' + item.link + '\" &gt;' + item.title + '&lt;/h2&gt;&lt;/a&gt;';<br>                    output += '&lt;p&gt;' + item.description + '&lt;/p&gt;';<br>                });</pre>\n<pre>$content.html(output);</pre>\n<pre>}</pre>\n<pre>});</pre>\n<p>These lines parse the data from the rss then output as JSON. This JSON is then used and and appended to the output variable. First the feed title is added as a h1 element. After this for each of the items, or posts a heading is added as a h2 element that is linked to the url and followed by the description as a paragraph.</p>\n<p>This works fine for a tidy rss feed like tech crunch but the provided rss from Medium isn’t so nice so we need to make some changes to tidy it up a little.</p>\n<h4>Step 3: Tidying up the output</h4>\n<p>With an understanding of how the rss to json api is working we are ready to tidy up our feed and get everything we want from Medium.</p>\n<p>Below is the actual code that I am using:</p>\n<pre>$(<em>function</em> () {</pre>\n<pre><em>var</em> $content = $('#jsonContent');</pre>\n<pre><em>var</em> data = {</pre>\n<pre>rss_url: 'https://medium.jasonmdesign.com/feed'</pre>\n<pre>};</pre>\n<pre>$.get('https://api.rss2json.com/v1/api.json', data, <em>function</em> (<em>response</em>) {</pre>\n<pre>if (response.status == 'ok') {</pre>\n<pre><em>var</em> output = '';</pre>\n<pre>$.each(response.items, <em>function</em> (<em>k</em>, <em>item</em>) {</pre>\n<pre><em>var</em> visibleSm;</pre>\n<pre>if(k &lt; 3){</pre>\n<pre>visibleSm = '';</pre>\n<pre>} else {</pre>\n<pre>visibleSm = ' visible-sm';</pre>\n<pre>}</pre>\n<pre>output += '&lt;div class=\"col-sm-6 col-md-4' + visibleSm + '\"&gt;';</pre>\n<pre>output += '&lt;div class=\"blog-post\"&gt;&lt;header&gt;';</pre>\n<pre>output += '&lt;h4 class=\"date\"&gt;' + $.format.date(item.pubDate, \"dd&lt;br&gt;MMM\") + \"&lt;/h4&gt;\";</pre>\n<pre><em>var</em> tagIndex = item.description.indexOf('&lt;img'); // Find where the img tag starts</pre>\n<pre><em>var</em> srcIndex = item.description.substring(tagIndex).indexOf('src=') + tagIndex; // Find where the src attribute starts</pre>\n<pre><em>var</em> srcStart = srcIndex + 5; // Find where the actual image URL starts; 5 for the length of 'src=\"'</pre>\n<pre><em>var</em> srcEnd = item.description.substring(srcStart).indexOf('\"') + srcStart; // Find where the URL ends</pre>\n<pre><em>var</em> src = item.description.substring(srcStart, srcEnd); // Extract just the URL</pre>\n<pre>output += '&lt;div class=\"blog-element\"&gt;&lt;img class=\"img-responsive\" src=\"' + src + '\" width=\"360px\" height=\"240px\"&gt;&lt;/div&gt;&lt;/header&gt;';</pre>\n<pre>output += '&lt;div class=\"blog-content\"&gt;&lt;h4&gt;&lt;a href=\"'+ item.link + '\"&gt;' + item.title + '&lt;/a&gt;&lt;/h4&gt;';</pre>\n<pre>output += '&lt;div class=\"post-meta\"&gt;&lt;span&gt;By ' + item.author + '&lt;/span&gt;&lt;/div&gt;';</pre>\n<pre><em>var</em> yourString = item.description.replace(/&lt;img[^&gt;]*&gt;/g,\"\");</pre>\n<pre><em>var</em> maxLength = 120 // maximum number of characters to extract</pre>\n<pre>//trim the string to the maximum length</pre>\n<pre><em>var</em> trimmedString = yourString.substr(0, maxLength);</pre>\n<pre>//re-trim if we are in the middle of a word</pre>\n<pre>trimmedString = trimmedString.substr(0, Math.min(trimmedString.length, trimmedString.lastIndexOf(\" \")))</pre>\n<pre>output += '&lt;p&gt;' + trimmedString + '...&lt;/p&gt;';</pre>\n<pre>output += '&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;';</pre>\n<pre>return k &lt; 3;</pre>\n<pre>});</pre>\n<pre>$content.html(output);</pre>\n<pre>}</pre>\n<pre>});</pre>\n<pre>});</pre>\n<p>The important parts are still the same but we have clearly made some changes. Using the jQuery date format plugin found <a href=\"https://github.com/phstc/jquery-dateFormat\">here</a> we are able to format the date given to us from medium however we like according to its documentation. This can be seen below.</p>\n<pre>output += '&lt;h4 class=\"date\"&gt;' + $.format.date(item.pubDate, \"dd&lt;br&gt;MMM\") + \"&lt;/h4&gt;\";</pre>\n<p>Next you probably want to display some kind of thumbnail. Now Medium doesn’t give you your thumbnail source it’s only included as an image in your post (if you included it that is) so we want to snatch this up. To do this we had to play around using jQuery to sort through our description and find the first image tag then grab the source from this and use it to display our thumbnail.</p>\n<pre><em>var</em> tagIndex = item.description.indexOf('&lt;img'); // Find where the img tag starts</pre>\n<pre><em>var</em> srcIndex = item.description.substring(tagIndex).indexOf('src=') + tagIndex; // Find where the src attribute starts</pre>\n<pre><em>var</em> srcStart = srcIndex + 5; // Find where the actual image URL starts; 5 for the length of 'src=\"'</pre>\n<pre><em>var</em> srcEnd = item.description.substring(srcStart).indexOf('\"') + srcStart; // Find where the URL ends</pre>\n<pre><em>var</em> src = item.description.substring(srcStart, srcEnd); // Extract just the URL</pre>\n<pre>output += '&lt;div class=\"blog-element\"&gt;&lt;img class=\"img-responsive\" src=\"' + src + '\" width=\"360px\" height=\"240px\"&gt;&lt;/div&gt;&lt;/header&gt;';</pre>\n<p>The title link and author are pretty self explanatory so there is no need to go into detail on these however the description is also a little tricky with images being included, and the entire article parsed. So we first remove any images from the content.</p>\n<pre><em>var</em> yourString = item.description.replace(/&lt;img[^&gt;]*&gt;/g,\"\");</pre>\n<p>After this we set a max length in the number of characters we want included. This is pretty good but we also don’t want a word to be chopped off in the middle so we make sure that this doesn't happen also by re-trimming the description if we are in the middle of a word.</p>\n<pre><em>var</em> maxLength = 120 // maximum number of characters to extract</pre>\n<pre>//trim the string to the maximum length</pre>\n<pre><em>var</em> trimmedString = yourString.substr(0, maxLength);</pre>\n<pre>//re-trim if we are in the middle of a word</pre>\n<pre>trimmedString = trimmedString.substr(0, Math.min(trimmedString.length, trimmedString.lastIndexOf(\" \")))</pre>\n<pre>output += '&lt;p&gt;' + trimmedString + '...&lt;/p&gt;';</pre>\n<p>Last of all we want to finish the loop if a certain number of posts is reached so we use a return to end the loop.</p>\n<pre>return k &lt; 3;</pre>\n<p>This return finishes the loop at 4 posts but can be changed to however many or few you need or omitted completely if you want all of your posts.</p>\n<p>The last thing we do is append the outputted html to the content tag defined earlier.</p>\n<pre>$content.html(output);</pre>\n<h4>Finishing things up</h4>\n<p>Hopefully now you have everything up and running and your Medium posts are displaying on your own website. If not I have a CodePen <a href=\"https://codepen.io/jasonm4130/pen/vZYbQx\">https://codepen.io/jasonm4130/pen/vZYbQx</a> which might be able to help you get some more insight. Failing that I am always reachable through social media or my websites contact page.</p>\n<p>I really hope that this has helped shortcut some of the troubles I went through to find this solution.</p>\n<p>Would love to hear from you!</p>\n<p>If you liked this article please click the ❤ below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=d772b3b05779\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/display-medium-articles-on-your-site-d772b3b05779\">Display Medium articles on your site.</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "html",
        "json",
        "web-development",
        "api",
        "medium"
      ]
    },
    {
      "id": "d0b419c2cf18",
      "title": "Why your website needs to be on point.",
      "pubDate": "2017-01-11 20:23:55",
      "link": "https://medium.jasonmdesign.com/why-your-website-needs-to-be-on-point-d0b419c2cf18?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/d0b419c2cf18",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "coverImage": "https://cdn-images-1.medium.com/max/1024/0*Q71T4Fi_QezH061_.jpg",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/0*Q71T4Fi_QezH061_.jpg",
      "duration": 8,
      "description": "Everyone knows that websites are important. With transactions, interactions, and engagement happening on the internet, you’d be crazy to try and say a website isn’t important.",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*Q71T4Fi_QezH061_.jpg\"></figure><p>Everyone knows that websites are important. With transactions, interactions, and engagement happening on the internet, you’d be crazy to try and say a website isn’t important.</p>\n<h3>But do you know why?</h3>\n<p>This is where we divert a little from the generic and delve a bait deeper into why your website is so crucial to you and your business.</p>\n<p>Your website should be number one, your base camp, your companies home online. This isn’t to say that other platforms like Facebook, Twitter, Instagram, or Snapchat can’t be great for promoting your business. They can be. Other platforms have one downside. You can’t control them. That’s right you think you have control over your content that you put up on these websites but you don’t. They control it all.</p>\n<p>With the blink of an eye any of these sites could call it quits, they could close down (ok this is probably unlikely). They could blacklist you or your company. Think about it, you go to sleep one night with 80% of your clients coming from Facebook, and the rest word of mouth. You don’t have a website because your Facebook page has been working fine for you. You wake up in the morning with an email letting you know Facebook has canceled your account. BOOM 80% of your revenue gone, Facebook was the one place these people contacted and connected with you and it’s gone now.</p>\n<p>Another example, one that has actually happened to me. Your working through a third party marketplace. In my case fiverr, you’re doing a decent amount of sales, nothing spectacular but you are doing ok. Then the next thing you know the algorithm has changed you don’t rank anymore. You’ve lost 100% of your sales in a matter of days and their is nothing you can do about it, except start from scratch again.</p>\n<h3>How you should use your website</h3>\n<p>With the reasons you shouldn’t be relying on social media and website out of your control outline above, we can jump into how you should use your website to mitigate this.</p>\n<p>Your online endeavor’s should be like a funnel with all your social media, forum posts, and anything else you do pointing back to your website. This is an essential part to any marketing strategy.</p>\n<p>Social media allows you to reach out and interact with people that would otherwise be impossible for you to reach through any other for of marketing. This is great, but for most service or product based businesses, there isn’t a way to directly sell on these platforms. I’ve never sent a web design proposal over Facebook, but I have found many clients through social channels. Social media accounts aren’t the right place to be conducting business transactions.</p>\n<p>This is where your website comes into its own. With a conversion optimized website you can ensure that every one of your followers from social media that click through to your website become leads and clients of yours.</p>\n<p>Optimizing your website means more than making it look good, there are a whole host of things that need to line up properly to get your visitors to contact you or buy your stuff. Your design has to be good, your copywriting has to be excellent, and above all your product or service must speak directly to your clients.</p>\n<p>Have you ever visited a website where everything on the page spoke to you? Like the designer had been sitting over you shoulder, or reading your mind when you were wishing to find whatever you just stumbled across? This is what an optimized website does for you.</p>\n<p>It makes people buy things that they didn’t even know they wanted! This isn’t a bad thing though because what they have bought is so amazing that they will appreciate it for a long time.</p>\n<p>Stay tuned to find out more ways to bring new customers to your website and optimize it so that they convert.</p>\n<p>If you liked this article please click the ❤ below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=d0b419c2cf18\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/why-your-website-needs-to-be-on-point-d0b419c2cf18\">Why your website needs to be on point.</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "social-media",
        "website",
        "social-media-marketing"
      ]
    },
    {
      "id": "f91e4d691d91",
      "title": "Why Web Professionals need to go outside.",
      "pubDate": "2016-12-20 21:39:43",
      "link": "https://medium.jasonmdesign.com/why-web-professionals-need-to-go-outside-f91e4d691d91?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/f91e4d691d91",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "duration": 3,
      "coverImage": "https://cdn-images-1.medium.com/max/1024/0*xt4JRgdWApRamPa8.jpg",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/0*xt4JRgdWApRamPa8.jpg",
      "description": "Lately I have been thinking about marketing my own web design and development agency, I’ve looked at all of the online avenues. While researching these it made me realise something very important. They have almost no barrier to entry for web professionals. This low barrier to entry for particular markets is exactly why you need to go outside.",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*xt4JRgdWApRamPa8.jpg\"></figure><p>Lately I have been thinking about marketing my own web design and development agency, I’ve looked at all of the online avenues. While researching these it made me realise something very important. They have almost no barrier to entry for web professionals. This low barrier to entry for particular markets is exactly why you need to go outside.</p>\n<h3>Barrier to entry, what is it?</h3>\n<p>The best way I can describe a barrier to entry is by describing a scenario. Imagine there is this beautiful park, where all our friends and family are playing. You naturally want to go and play there with them too. Unfortunately there is something stopping you. A huge fence with no way around. You either have to climb over, or dig under. This fence is your barrier to entry for the park.</p>\n<p>Barriers to entry aren’t just for parks though they could be for anything. Take tertiary education for example, a barrier to entry for many students is their grades during high school, or another barrier could be their financial situation. Both of these can be overcome but they make it a little harder for everyone to go to University or college. These are barriers to entry.</p>\n<h3>Why a barrier to entry matters?</h3>\n<p>So to illustrate a barrier to entry I have thought of a scenario. Well two scenarios in fact, both very similar in many aspects but with a few slight changes that make all the difference.</p>\n<h3>Scenario 1</h3>\n<p>You visit a market on the weekend, there are store owners and it’s generally a great atmosphere. The store owners yell out about the great deals they are offering and their amazing products. Some owners selling amazing pottery, other the most beautiful jewelry, and even others selling the finest foods. It’s a great atmosphere, you come here often and make purchases every now and then.</p>\n<h3>Scenario 2</h3>\n<p>Similar to scenario 1 you are at a market. This time it’s different though, the store owners are all selling exactly the same things. They all say that their thing is different to the others, better even. They describe the differences in words you don’t really understand but know are important. They even try and show you the difference but you still can’t really see it more than just the superficial impact that it has. It’s not a very enjoyable for you or for them.</p>\n<h3>Where you fit in.</h3>\n<p>Thinking about these scenarios, and about web professionals. The barrier to entry for a web professional to advertise online is so low that every web professional is doing it. It ends up as a market place with everyone selling essentially the same thing, which just confuses buyers even more. There is a reason that 80% of web professionals find their clients through referrals. It’s because they have distinguished themselves from the crowd by being trusted by a third party.</p>\n<p>Now I’m not saying that the only way for web professionals to market is through offline means, because it’s not. Marketing online can be very effective if done right. But the emphasis needs to be on the done right, not on being done half baked with some good ideas thrown into the mix, you’re wasting your time.</p>\n<p>So go spend some time outside, and meet some new people. Or even meet with some new potential clients. What are you waiting for?</p>\n<p><em>Originally published at </em><a href=\"https://jasonmdesign.com/blog/why-you-need-to-go-outside/\"><em>jasonmdesign.com</em></a><em>.</em></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=f91e4d691d91\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/why-web-professionals-need-to-go-outside-f91e4d691d91\">Why Web Professionals need to go outside.</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "web-design",
        "marketing",
        "web-development",
        "startup",
        "online-marketing"
      ]
    },
    {
      "id": "db26418aa559",
      "title": "What’s wrong with CSS Frameworks, and how to fix them.",
      "pubDate": "2016-12-16 12:15:02",
      "link": "https://medium.jasonmdesign.com/whats-wrong-with-css-frameworks-and-how-to-fix-them-db26418aa559?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/db26418aa559",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "coverImage": "https://cdn-images-1.medium.com/max/1024/0*XeITMiOkrQjmq6Wy.jpg",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/0*XeITMiOkrQjmq6Wy.jpg",
      "duration": 8,
      "description": "Many designers and developers use frameworks like bootstrap or foundation. They are great at speeding up the development process and allowing developers to write code that is easier for others to work on and maintain.",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*XeITMiOkrQjmq6Wy.jpg\"></figure><p>Many designers and developers use frameworks like bootstrap or foundation. They are great at speeding up the development process and allowing developers to write code that is easier for others to work on and maintain.</p>\n<p>For all the benefits that a framework like bootstrap offers it has a dark side. It fills your projects with bloat. But it doesn’t have to be this way. There are two ways of getting around this. The first is using the SASS version of bootstrap and only including the parts that you use. A good alternative but I wanted something more hands free. I can write code with anything from bootstrap and not worry about making sure I include the proper code in my SASS build.</p>\n<p>Enter UnCSS a tool that will analyze your html and remove any unused CSS selectors from your stylesheets. All the benefits of a full framework, without needing to worry about bloat or adding SASS components.</p>\n<h3>Getting Started with UnCSS</h3>\n<p>First you are going to need to have a gulp or grunt workflow setup and honestly if you are reading this I hope you already do. If you don’t however head over to <a href=\"https://css-tricks.com/gulp-for-beginners/\">CSS Tricks Gulp for beginners</a> and you will be up and running in no time.</p>\n<p>Once you have your gulp workflow worked out, simply install gulp-uncss by running the following command in your project folder.</p>\n<pre>npm install gulp-uncss --save-dev</pre>\n<p>With UnCSS installed we are ready to set up our task. To start with you are going to need to declare UnCSS.</p>\n<pre>var uncss = require(‘gulp-uncss’);</pre>\n<p>The way that I have UnCSS setup is to read css files from a source folder, check them against the html files that make up my site and then remove the unused selectors and place the bloat free css in another folder which I then import with my SASS command.</p>\n<p>My UnCSS task looks as follows:</p>\n<pre>gulp.task('uncss', function () { return gulp.src('assets/css/1-tools/uncss-source/**/*') .pipe(uncss({ html: ['_site/**/*.html'], ignore: [/\\w\\.in/, \".fade\", \".collapse\", \".collapsing\", /(#|\\.)navbar(\\-[a-zA-Z]+)?/, /(#|\\.)dropdown(\\-[a-zA-Z]+)?/, /(#|\\.)(open)/, \".modal\", \".modal.fade.in\", \".modal-dialog\", \".modal-document\", \".modal-scrollbar-measure\", \".modal-backdrop.fade\", \".modal-backdrop.in\", \".modal.fade.modal-dialog\", \".modal.in.modal-dialog\", \".modal-open\", \".in\", \".modal-backdrop\"] })) .pipe(gulp.dest('assets/css/1-tools/uncss')); });</pre>\n<p>First it gets any css files in the source directory. Next it will run UnCSS against the html files in my sites directory.</p>\n<p>You will note here that I have a large number of ignores present. This is because UnCSS isn’t quite smart enough to know when a class is added after the initial html, via something like jquery. This is a list of the styles that bootstrap add through js to make things like the responsive nav and modal to work. If you don’t use these features though, you won’t need to worry about this.</p>\n<p>Once UnCSS has run it will pipe the outputted css back into a separate folder to be linked to or included in SASS from there.</p>\n<p>Using this method I was able to reduce bootstrap from 6760 lines of uncompressed css and 150kb to 1607 lines and 35kb this is a huge saving, and when the code is minified for the production site it’s even more substantial.</p>\n<p>I hope that this has helped you to use frameworks more effectively and efficiently in your own design and development work.</p>\n<p>If you liked this article please click the ❤ below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=db26418aa559\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/whats-wrong-with-css-frameworks-and-how-to-fix-them-db26418aa559\">What’s wrong with CSS Frameworks, and how to fix them.</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "gulp",
        "javascript"
      ]
    },
    {
      "id": "eea12c069fd0",
      "title": "Sync Atom with Dropbox",
      "pubDate": "2016-12-16 12:14:28",
      "link": "https://medium.jasonmdesign.com/sync-atom-with-dropbox-eea12c069fd0?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/eea12c069fd0",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "duration": 3,
      "thumbnail": "https://cdn-images-1.medium.com/max/800/0*yFUREDoBj8qImKON.jpg",
      "coverImage": "https://cdn-images-1.medium.com/max/800/0*yFUREDoBj8qImKON.jpg",
      "description": "This is a quick tutorial on how to sync the Atom code editor setup between PC’s running windows. Using dropbox or any other cloud storage service.",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/0*yFUREDoBj8qImKON.jpg\"></figure><p>This is a quick tutorial on how to sync the Atom code editor setup between PC’s running windows. Using dropbox or any other cloud storage service.</p>\n<p>Using a laptop that I can take between clients work and home is great, but I also love the benefits that a standard desktop offers me. So I use both as I am sure many many others do. I do front-end development and design, that’s my job. I rely on my code editor for daily tasks. Switching between two PC’s with slightly different configurations is an annoyance that I don’t want to deal with.</p>\n<p>I used a sync extension for Atom which helped the problem greatly and saved me a lot of time. This worked well but it wasn’t a perfect solution. My plugins would need updating on both computers whenever I fired up Atom. Some settings for whatever reason just didn’t copy across with the sync plugin.</p>\n<p>This is why I decided to come up with my own better solution to the problem. The technique I am going to describe can be used for a many of apps and programs, so keep it in mind for other problems like this also.</p>\n<h3>What you’ll need</h3>\n<ul>\n<li>Dropbox (or another cloud storage service) set-up on both PC’s</li>\n<li>SymLink Creator (this can also be done in command prompt but I have found the GUI to be extremely helpful) which can be found here</li>\n<li>Long Path Eraser (This may not be needed but it’s a useful tool to be aware of anyway) found here</li>\n<li>A zip tool like 7 Zip</li>\n</ul>\n<h3>What we are going to be doing</h3>\n<p>The idea behind what we are doing is pretty simple. If you have done any research into this topic before I am sure you will have come across similar methods.</p>\n<p>We are going to be moving the Atom packages, settings and extensions folder to our cloud storage (Dropbox). Then linking the default locations for this on both computers to this one folder.</p>\n<h3>Moving the File</h3>\n<p>To start our process we need to move the Atom folder from its current location. It is kept in your user’s current directory. On windows, an easy shortcut to get here is to paste the following code into the bar in any explorer window.</p>\n<pre>%UserProfile%</pre>\n<p>This in your user’s directory you should see a file titled .atom this is the one we need. I had to use 7 Zip to compress the folder to copy it across to Dropbox, as the file paths were too long to use the normal copy-paste operation.</p>\n<p>I zipped the file and then moved the zipped file over to Dropbox. It doesn’t matter where you place the file in Dropbox but I prefer somewhere that makes sense and is out of the way.</p>\n<p>From here you will need to extract the folder making sure to select the option “extract to .atom/”. This will add your folder to Dropbox which will keep it in sync for us.</p>\n<p>This is where the magic happens. We are going to link the old file path to the new path that will be in sync. This will need to be done on both computers.</p>\n<p>The first thing we need to do is delete the old .atom folder. For me because the file path names were too long. I needed to use the Long Path Eraser Tool at this point because the file names were too long for windows to handle natively. If you have different settings on the two PC’s only the settings and extensions from the copied folder will be kept.</p>\n<p>After deleting the old .atom folders in your user directories, fire up Symlink Creator.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/458/0*d0-gs9Yupok6vHW0.jpg\"></figure><p>In the link folder section, you are going to need to put the file path that we took the original .atom folder from. For me, this was C:\\Users\\Jason. You will also need to name the link .atom</p>\n<p>In the destination folder, you will need to put the path to the folder in Dropbox. Remembering that these paths may be different on your different PCs.</p>\n<p>Double check that you have selected “folder symbolic link” as the type at the top, and symbolic link in the destination folder down the bottom.</p>\n<p>From here you can simply click create a link and that’s it you’re finished. Remember that this needs to be done on both computers.</p>\n<p>If you liked this article please click the ❤ below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=eea12c069fd0\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/sync-atom-with-dropbox-eea12c069fd0\">Sync Atom with Dropbox</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "dropbox",
        "dropbox-free-space"
      ]
    },
    {
      "id": "550f885a581b",
      "title": "Include Plugins in WordPress Theme",
      "pubDate": "2016-12-16 12:13:54",
      "link": "https://medium.jasonmdesign.com/include-plugins-in-wordpress-theme-550f885a581b?source=rss----c61893bb5deb---4",
      "guid": "https://medium.com/p/550f885a581b",
      "author": {
        "name": "Jason Matthew",
        "image": "https://cdn-images-1.medium.com/fit/c/200/200/1*YYieiQhlhPDhZfC4iSLNVQ.jpeg"
      },
      "duration": 4,
      "thumbnail": "https://cdn-images-1.medium.com/max/800/0*14em1t8BjKdYfpZ-.jpg",
      "coverImage": "https://cdn-images-1.medium.com/max/800/0*14em1t8BjKdYfpZ-.jpg",
      "description": "Today I was talking with a friend in a Slack community that I am a part of. He is working on building his first custom WordPress website. I was talking with him about how he was doing it, and how I have built websites in the past. The topic turned to the plugins he was using. As it would be the tools he was using were similar to those I had used to build sites.",
      "content": "\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/800/0*14em1t8BjKdYfpZ-.jpg\"></figure><p>Today I was talking with a friend in a Slack community that I am a part of. He is working on building his first custom WordPress website. I was talking with him about how he was doing it, and how I have built websites in the past. The topic turned to the plugins he was using. As it would be the tools he was using were similar to those I had used to build sites.</p>\n<p>We talked about them, and I shared how I had included Advanced Custom Fields with my theme. I felt it made a more concise and eloquent solution than having to install the plugin when the theme was installed. He had never heard of doing this, and I remember it took me a while to figure out how to do this myself. So in the hope of lessening someone’s learning curve, I am sharing with you now.</p>\n<p>So to get us started, why would you want to include a plugin with a theme rather than installing it separately? Well, there are arguments for and against, I will just talk about why I made my choice. I think a plugin that adds functionality and is essential to the theme you are building should be included with it. If it’s needed for the theme to function then you would never have an instance with the theme installed and not the plugin, so it seems silly to have to install both.</p>\n<p>As I walk you through this process I will be using the advanced custom fields plugin as an example, but the process should be similar if not the same for other plugins too. If you don’t know what Advanced Custom Fields is, you should. Every WordPress developer at some stage has used it, wanted to use it, should have used it, or will use it.</p>\n<p>So let’s get started. First off you are going to need to get the plugin downloaded you can do this from the WordPress <a href=\"https://wordpress.org/plugins/advanced-custom-fields/\">plugin directory</a>. Or from the advanced custom fields <a href=\"https://www.advancedcustomfields.com/\">website</a>.</p>\n<p>With this downloaded, we need to extract the contents of the zip file and place it somewhere within the theme folder. For me, I chose /inc/plugins I also renamed the advanced custom fields folder to just ACF to make it easier to reference later.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/425/0*euHuox4XGUxsedIJ.jpg\"></figure><p>With the contents of the plugin installed we need to include the main php file of the plugin in the functions.php of our theme.</p>\n<p>To do this we go to add some code to our functions.php (Obviously)</p>\n<pre>// 1. customize ACF path add_filter(‘acf/settings/path’, ‘my_acf_settings_path’); function my_acf_settings_path( $path ) { // update path $path = get_stylesheet_directory() . ‘/inc/plugins/acf/’; // return return $path; }</pre>\n<p>This first bit of code changes the path for the advanced custom fields settings. Notice the only part that you will need to change from this is the $path variable, where ‘/inc/plugins/acf/’ should represent your folder structure.</p>\n<p>The next section of code we add does a similar thing to that above except it changed the location of the directory for ACF. Again the only part that requires changing is the $dir path to represent your folder structure.</p>\n<pre>// 2. customize ACF dir add_filter(‘acf/settings/dir’, ‘my_acf_settings_dir’); function my_acf_settings_dir( $dir ) { // update path $dir = get_stylesheet_directory_uri() . ‘/inc/plugins/acf/’; // return return $dir; }</pre>\n<p>These two parts of code above are specific for advanced custom fields and for other plugins may not be required, or they may require different filters to be passed to them.</p>\n<p>This next piece of code will be similar if not the same for including every plugin within your theme. In it we actually include the main php file of the plugin. In this case that is acf.php. Here again you will need to change the code to match your folder structure, and the name of the php file we are including to match whatever plugin it is that you are including.</p>\n<pre>// 3. Include ACF include_once( get_stylesheet_directory() . ‘/inc/plugins/acf/acf.php’ );</pre>\n<p>If all this has gone well you should be able to save your functions.php and reload your browser and have advanced custom fields included with your theme.</p>\n<p>If you liked this article please click the ❤ below. It’ll let me know you’d like to read more articles like this, and it’ll help other people discover the article as well. If you’re looking for a new web developer I am always looking to work on interesting projects. Contact me at <a href=\"https://jasonmatthew.me/\">jasonmatthew.me</a></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=550f885a581b\" width=\"1\" height=\"1\"><hr>\n<p><a href=\"https://medium.jasonmdesign.com/include-plugins-in-wordpress-theme-550f885a581b\">Include Plugins in WordPress Theme</a> was originally published in <a href=\"https://medium.jasonmdesign.com/\">JasonMDesign</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>\n",
      "enclosure": [],
      "categories": [
        "web-development",
        "wordpress"
      ]
    }
  ]
}
